In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("Salary_Dataset_with_Extra_Features.csv")

In [4]:
df

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,Sasken,Android Developer,400000,3,Bangalore,Full Time,Android
1,4.5,Advanced Millennium Technologies,Android Developer,400000,3,Bangalore,Full Time,Android
2,4.0,Unacademy,Android Developer,1000000,3,Bangalore,Full Time,Android
3,3.8,SnapBizz Cloudtech,Android Developer,300000,3,Bangalore,Full Time,Android
4,4.4,Appoids Tech Solutions,Android Developer,600000,3,Bangalore,Full Time,Android
...,...,...,...,...,...,...,...,...
22765,4.7,Expert Solutions,Web Developer,200000,1,Bangalore,Full Time,Web
22766,4.0,Nextgen Innovation Labs,Web Developer,300000,1,Bangalore,Full Time,Web
22767,4.1,Fresher,Full Stack Web Developer,192000,13,Bangalore,Full Time,Web
22768,4.1,Accenture,Full Stack Web Developer,300000,7,Bangalore,Full Time,Web
22769,3.8,Thomson Reuters,Associate Web Developer,300000,7,Bangalore,Full Time,Web

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22770 entries, 0 to 22769
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Rating             22770 non-null  float64
 1   Company Name       22770 non-null  object
 2   Job Title          22770 non-null  object
 3   Salary             22770 non-null  int64
 4   Salaries Reported  22770 non-null  int64
 5   Location           22770 non-null  object
 6   Employment Status  22770 non-null  object
 7   Job Roles          22770 non-null  object
dtypes: float64(1), int64(2), object(5)
memory usage: 1.4+ MB

In [36]:
df["Job Roles"].unique()

array([ 0,  1,  2,  3,  4,  5,  6,  8,  7, 10,  9])

In [35]:
df["Salaries Reported"].min(),df["Salaries Reported"].max()

(1, 361)

In [33]:
df["Company Name"].value_counts()

9161     271
660      184
4486     169
313      150
2094     144
        ...
9118       1
10412      1
8569       1
2564       1
6373       1
Name: Company Name, Length: 11261, dtype: int64

In [6]:
df["Company Name"].unique()

array(['Sasken', 'Advanced Millennium Technologies', 'Unacademy', ...,
       'Unicon Systems', 'Expert Solutions', 'Nextgen Innovation Labs'],
      dtype=object)

In [7]:
df["Job Title"].unique()

array(['Android Developer', 'Android Developer - Intern',
       'Android Developer - Contractor', ..., 'Web Developer Contractor',
       'Full Stack Web Developer', 'Associate Web Developer'],
      dtype=object)

In [8]:
df["Employment Status"].unique()

array(['Full Time', 'Intern', 'Contractor', 'Trainee'], dtype=object)

In [9]:
df["Location"].unique()

array(['Bangalore', 'Chennai', 'Hyderabad', 'New Delhi', 'Pune', 'Jaipur',
       'Kerala', 'Kolkata', 'Madhya Pradesh', 'Mumbai'], dtype=object)

In [10]:
from sklearn.preprocessing import LabelEncoder

In [11]:
le = LabelEncoder()
for i in df.select_dtypes(include=["object"]).columns:
    df[i]= le.fit_transform(df[i])
df

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,8130,28,400000,3,0,1,0
1,4.5,417,28,400000,3,0,1,0
2,4.0,9778,28,1000000,3,0,1,0
3,3.8,8534,28,300000,3,0,1,0
4,4.4,884,28,600000,3,0,1,0
...,...,...,...,...,...,...,...,...
22765,4.7,3142,1071,200000,1,0,1,10
22766,4.0,6373,1071,300000,1,0,1,10
22767,4.1,3444,264,192000,13,0,1,10
22768,4.1,313,264,300000,7,0,1,10
22769,3.8,9487,91,300000,7,0,1,10

In [12]:
y = df["Salary"]

In [13]:
y

0         400000
1         400000
2        1000000
3         300000
4         600000
          ...
22765     200000
22766     300000
22767     192000
22768     300000
22769     300000
Name: Salary, Length: 22770, dtype: int64

In [14]:
x = df.drop("Salary", axis= 1)

In [15]:
x

,Rating,Company Name,Job Title,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,8130,28,3,0,1,0
1,4.5,417,28,3,0,1,0
2,4.0,9778,28,3,0,1,0
3,3.8,8534,28,3,0,1,0
4,4.4,884,28,3,0,1,0
...,...,...,...,...,...,...,...
22765,4.7,3142,1071,1,0,1,10
22766,4.0,6373,1071,1,0,1,10
22767,4.1,3444,264,13,0,1,10
22768,4.1,313,264,7,0,1,10
22769,3.8,9487,91,7,0,1,10

In [16]:
from sklearn.model_selection import train_test_split

In [17]:
x_train,x_test,y_train,y_test = train_test_split(x,y , test_size=0.20)

In [18]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.ensemble import GradientBoostingRegressor
from sklearn.ensemble import AdaBoostRegressor
from sklearn.svm import SVR
from xgboost import XGBRegressor
from sklearn.metrics import r2_score
from sklearn.metrics import mean_squared_error
from sklearn.metrics import mean_absolute_error

In [19]:
model1 = RandomForestRegressor().fit(x_train,y_train)
y_pred = model1.predict(x_test)
print(r2_score(y_test, y_pred), mean_squared_error(y_test,y_pred), mean_absolute_error(y_test,y_pred))

0.10889649364030374 387322081751.8612 379272.87348307087

In [20]:
model2 = GradientBoostingRegressor().fit(x_train,y_train)#Final Better
y_pred = model2.predict(x_test)
print(r2_score(y_test,y_pred), mean_squared_error(y_test,y_pred), mean_absolute_error(y_test,y_pred))

0.17347988211454135 359250626200.50836 367170.54900812294

In [21]:
model3 = AdaBoostRegressor().fit(x_train,y_train)
y_pred = model3.predict(x_test)
print(r2_score(y_test,y_pred), mean_squared_error(y_test,y_pred),mean_absolute_error(y_test,y_pred))

-1.233248366594438 970691283610.7139 741794.2407895405

In [22]:
model4 = SVR().fit(x_train,y_train)
y_pred = model4.predict(x_test)
print(r2_score(y_test,y_pred),mean_squared_error(y_test,y_pred),mean_absolute_error(y_test,y_pred))

-0.08315971270694322 470800161598.79877 400775.8809304583

In [23]:
model5 = XGBRegressor().fit(x_train,y_train)
y_pred = model5.predict(x_test)
print(r2_score(y_test,y_pred),mean_squared_error(y_test,y_pred),mean_absolute_error(y_test,y_pred))

0.17202860116958618 359881441280.0 360768.75

In [24]:
import pickle

In [25]:
pickle.dump(model2,open("Salary_prediction.pkl","wb"))